<template>
    <div class="termsTgreement mobileDialog">
        <el-dialog
            :title="seedType=='regist'?'易安联用户注册协议':'隐私政策'"
            :visible.sync="dialogVisible"
            width="80%"
            :fullscreen="true"

            @close="closeDialog"
        >
            <!--top="10vh"-->
            <div class="dialog_content">
                <!--
                    添加内容说明：
                    段落标题用 h2 标签，如果有文档标题用h2标签加main_title类
                    普通文本用 p 标签包含，加粗文本用带 bold 类的标签包含，缩进段落用带 indent 类的p标签包含
                    若段落之间包含粗体文字，用 p 标签包含整个段落，再用 span 标签包含粗体部分
                -->
                <div v-if="seedType=='regist'?true:false">
                    <!--<h2 class="main_title">易安联用户注册协议</h2>-->
                    <p>本协议是您与易安联网络技术有限公司所有者（以下简称为;易安联;）之间就易安联网站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击;同意并继续;按钮后，本协议即构成对双方有约束力的法律文件。</p>
                    <h2>第1条 本站服务条款的确认和接纳</h2>
                    <p>1.1本站的各项VPN服务的所有权和运作权归易安联所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
                    <p>1.2用户点击同意本协议的，即视为用户确认自己具有享受本站VPN等相应的权利能力和行为能力，能够独立承担法律责任。</p>
                    <p>1.3如果您在16周岁以下，您只能在父母或监护人的监护参与下才能使用本站。</p>
                    <p>1.4易安联保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容的权利。</p>
                    <h2>第2条 本站服务</h2>
                    <p>2.1易安联通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。</p>
                    <p>2.2用户必须自行准备如下设备和承担如下开支：</p>
                    <p class="indent">（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；</p>
                    <p class="indent">（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</p>
                    <h2>第3条 用户信息</h2>
                    <p>3.1用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且易安联保留终止用户使用易安联各项服务的权利。</p>
                    <p>3.2用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</p>
                    <p>3.3用户注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。</p>
                    <p class="bold">3.4用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
                    <p class="bold">3.5用户同意，易安联有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</p>
                    <h2>第4条 用户依法言行义务</h2>
                    <p>本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</p>
                    <p class="indent">（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
                    <p class="indent">（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</p>
                    <p class="indent">（3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
                    <p class="indent">（4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；</p>
                    <p class="indent">（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</p>
                    <p class="indent">（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
                    <p class="indent">（7）不得教唆他人从事本条所禁止的行为；</p>
                    <p class="indent">（8）不得利用在本站注册的账户进行牟利性经营活动；</p>
                    <p class="indent">（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</p>
                    <p>用户应不时关注并遵守本站不时公布或修改的各类合法规则规定。</p>
                    <p><span>本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。</span>用户须对自己在网上的言论和行为承担法律责任。</p>
                    <h2>第5条 商品信息</h2>
                    <p>本站上的信息随时都有可能发生变动，本站不作特别通知。由于网站信息的数量极其庞大，虽然本站会尽最大努力保证您所浏览信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本站网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解；易安联欢迎纠错，并会视情况给予纠错者一定的奖励</p>
                    <h2>第6条 所有权及知识产权条款</h2>
                    <p class="bold">6.1用户一旦接受本协议，即表明该用户主动将其在任何时间段在本站发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给易安联所有，用户同意易安联有权就任何主体侵权而单独提起诉讼。</p>
                    <p class="bold">6.2本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在易安联网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
                    <p class="bold">6.3用户同意并已充分了解本协议的条款，承诺不将已发表于本站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。</p>
                    <p class="bold">6.4易安联是本站的制作者,拥有此网站内容及资源的著作权等合法权利,受国家法律保护,有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的最大限度范围内，易安联对本协议及本站内容拥有解释权。</p>
                    <p class="bold">6.5除法律另有强制性规定外，未经易安联明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，易安联有权追究其法律责任。</p>
                    <p>6.6本站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是易安联或其内容提供者的财产，受中国和国际版权法的保护。本站上所有内容的汇编是易安联的排他财产，受中国和国际版权法的保护。本站上所有软件都是易安联或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</p>
                    <h2>第7条 责任限制及不承诺担保</h2>
                    <p class="bold">除非另有明确的书面说明,本站及其所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在;按现状;和;按现有;的基础上提供的。</p>
                    <p class="bold">除非另有明确的书面说明,易安联不对本站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
                    <p class="bold">易安联不担保本站所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本站发出的电子信件、信息没有病毒或其他有害成分。</p>
                    <p class="bold">如因不可抗力或其它本站无法控制的原因使本站销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，易安联会合理地尽力协助处理善后事宜。</p>
                    <h2>第8条 协议更新及用户关注义务</h2>
                    <p>根据国家法律法规变化及网站运营需要，易安联有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议。用户可随时登录查阅最新协议；<span>用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，可以且应立即停止接受易安联网站依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议。易安联建议您在使用本站之前阅读本协议及本站的公告。 </span>如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>
                    <h2>第9条 法律管辖和适用</h2>
                    <p>本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。 如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。 如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉讼。</p>
                    <h2>第10条 充值与退款</h2>
                    <p>11.1易安联所提供的VPN充值服务，由第三方完成，易安联提供详细的充值日志信息，由于因充值导致的经济纠纷，易安联不承担任何法律责任，请与第三方充值联系。</p>
                    <p>11.2易安联所提供的VPN退款服务，由第三方完成，易安联提供详细的图框日志信息，由于因退款导致的经济纠纷，易安联不承担任何法律责任，请与第三方充值联系。</p>
                    <p>11.3 用户套餐计费和退款标准：</p>
                    <p class="indent">1)用户充值的VPN套餐使用顺序按照套餐充值的时间顺序依次使用（流量除外），只有当上一个套餐使用完毕，才会进入下一个套餐计费中，不满一天按一天计费。</p>
                    <p class="indent">2)流量套餐和时间套餐同时拥有时，优先使用时间套餐，当时间套餐使用完毕后，才会使用流量套餐。</p>
                    <p class="indent">3)用户退款时，退款金额=您未是用的天数*未使用的天数的套餐单价（x元/天）+未使用的流量*当前流量套餐的单价（x元/1MB）</p>
                    <h2>第11条 其他</h2>
                    <p>11.1易安联网站所有者是指在政府部门依法许可或备案的易安联网站经营主体。</p>
                    <p>11.2易安联尊重用户和消费者的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本站欢迎用户和社会各界提出意见和建议，易安联将虚心接受并适时修改本协议及本站上的各类规则。</p>
                    <p>11.3本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</p>
                    <p>11.4您点击本协议下方的;同意并继续;按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>
                </div>
                <div v-else>
                    <p>易安联（以下或称“我们”）注重保护用户个人信息及个人隐私。本隐私政策解释了用户（“您”）个人信息收集（以下或称“信息”）和使用的有关情况，本隐私政策适用于易安联向您提供的所有相关服务（包括但不限于电子商务、网络资讯、网络社交、互联网金融服务等，以下称“易安联服务”或“服务”）。<span>如果您不同意本隐私政策的任何内容，您应立即停止使用易安联服务。当您使用易安联提供的任一服务时，即表示您已同意我们按照本隐私政策来合法使用和保护您的个人信息。</span></p>
                    <h2>一、您个人信息的收集</h2>
                    <p>我们收集信息是为了向您提供更好以及更个性化的服务，并努力提高您的用户体验。我们收集信息的种类如下：</p>
                    <h2>1、您向我们提供的信息</h2>
                    <p>当您注册易安联账户及您在使用相关易安联服务时填写、提交及/或其他任何方式提供的信息，包括您的姓名、身份证号码、电话号码、电子邮箱、收货地址、及相关附加信息。<span>您可以选择不提供某一或某些信息，但是这样可能使您无法使用易安联的许多特色服务。</span>请您理解，我们使用您提供的信息是为了回应您的要求，为您在易安联购物或享受服务提供便利，完善易安联网站以及与您进行信息沟通。另外，我们可能会将您所提供的信息与您的易安联账户关联，用以识别您的身份。</p>
                    <h2>2、我们在您使用服务过程中获得的信息</h2>
                    <p>为了提高服务质量和用户体验，我们会留存您使用服务以及使用方式的相关信息，这类信息包括：</p>
                    <p class="indent"><span>（1）您的浏览器和计算机上的信息。</span>在您访问易安联网站或使用易安联服务时，易安联系统自动接收并记录的您的浏览器和计算机上的信息（包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据）。</p>
                    <p class="indent"><span>（2）您的位置信息。</span>当您下载或使用易安联、其关联方及合作伙伴开发的应用程序（例如易安联APP），或访问移动网页使用易安联服务时，易安联可能会读取您的位置（大多数移动设备将允许您关闭定位服务，具体建议您联系您的移动设备的服务商或生产商）。</p>
                    <p class="bold indent">（3）您的设备信息。</p>
                    <p class="indent"><span>（4）您的行为信息。</span>易安联可能会记录您访问易安联或使用易安联服务时所进行的操作以及您在易安联网站上进行交易的相关信息。</p>
                    <p>除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括您与我们的客服团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与易安联的关联方、易安联合作伙伴之间互动时我们获得的相关信息。</p>
                    <p>同时，为提高您使用易安联提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些我们认为有风险的链接（“URL”）。</p>
                    <h2>3、来自第三方的信息</h2>
                    <p>指在您注册易安联账户和使用服务过程中，您授权的易安联可向易安联的关联方、合作伙伴所收集的相关信息，以及您授权的易安联的关联方、合作伙伴可向易安联分享相关的信息。这些信息包括但不限于您的身份信息、行为信息、交易信息、设备信息等，易安联会将此类信息汇总，用于帮助易安联向您提供更好以及更加个性化的服务或更好的预防互联网欺诈。</p>
                    <h2>您了解并同意，以下信息不适用本隐私政策：</h2>
                    <p class="indent">（1）您在使用易安联提供的搜索服务时输入的关键字信息；</p>
                    <p class="indent">（2）信用评价、违反法律法规规定或违反易安联平台规则行为及易安联已对您采取的措施；</p>
                    <p class="indent">（3）应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。</p>
                    <p class="indent">（4）其他您与易安联或易安联的关联方所签署的协议（包括在线签署的电子协议，例如《易安联用户注册协议》）以及易安联平台规则中明确约定或提示您不适用本隐私政策的与您有关的信息。</p>
                    <h2>二、我们对您个人信息的管理和使用</h2>
                    <p>为向您提供服务、提升我们的服务质量以及优化您的服务体验，我们会在符合法律规定或根据您授权的情况下使用您的个人信息，并主要用于下列用途：</p>
                    <p>1、向您提供您使用的各项服务，并维护、改进这些服务。</p>
                    <p>2、向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或在征得您同意的情况下与易安联的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。如您不希望接收上述信息，可通过相应的退订功能进行退订。</p>
                    <p>3、我们可能使用您的个人信息以验证身份、预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他易安联用户，或我们或其关联方的合法权益。</p>
                    <p>4、我们可能会将来自某项服务的个人信息与来自其他服务所获得的信息结合起来，用于为了给您提供更加个性化的服务使用，例如为让您通过购物拥有更广泛的社交圈而使用、共享或披露您的信息。</p>
                    <p>5、我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，以展示我们的产品或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。</p>
                    <p>6、让您参与有关我们产品及服务的调查。</p>
                    <p>7、经您同意或授权的其他用途。</p>
                    <h2>三、您个人信息的分享</h2>
                    <p>您的个人信息是我们为您提供服务的重要部分，我们会遵循法律规定对您的信息承担保密义务。<span>除以下情形外，我们不会将您的个人信息披露给第三方：</span></p>
                    <p>1、征得您的同意或授权。</p>
                    <p>2、根据法律法规的规定或行政或司法机构的要求。</p>
                    <p>3、出于实现“我们对您个人信息的管理和使用”部分所述目的，或为履行我们在《易安联用户注册协议》或本隐私政策中的义务和行使我们的权利，向易安联的关联方、合作伙伴或代表易安联履行某项职能的第三方（例如代表我们发出推送通知的通讯服务商、处理银行卡的支付机构等）分享您的个人信息。</p>
                    <p>4、如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能产生的权利纠纷。</p>
                    <p>5、只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。</p>
                    <p>6、您出现违反中国有关法律、法规规定或者违反您与易安联签署的相关协议（包括在线签署的电子协议）或违反相关易安联平台规则时需要向第三方披露的情形。</p>
                    <p>7、为维护易安联及其关联方或其他易安联用户的合法权益。</p>
                    <p class="bold">随着我们业务的发展，我们及我们的关联方有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。</p>
                    <h2>四、您个人信息的安全</h2>
                    <p>易安联严格保护您的个人信息安全。我们使用各种制度、安全技术和程序等措施来保护您的个人信息不被未经授权的访问、篡改、披露或破坏。如果您对我们的个人信息保护有任何疑问，请联系我们的客服。</p>
                    <p>在通过易安联网站与第三方进行网上商品或服务的交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址等。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请您立即联络我们的客服，以便我们采取相应措施。</p>
                    <h2>五、Cookie 及网络 Beacon的使用</h2>
                    <p>1、Cookie的使用</p>
                    <p>Cookie是由网页服务器存放在您的访问设备上的文本文件。指定给您的Cookie 是唯一的，它只能被将Cookie发布给您的域中的Web服务器读取。</p>
                    <p>易安联使用 Cookie 来帮助您实现您的联机体验的个性化，使您在易安联及其关联方获得更轻松的访问体验。例如，Cookie 会帮助您在后续访问易安联网站时调用您的信息，简化记录您填写个人信息（例如一键登录等）的流程；为您提供安全购物的偏好设置；帮助您优化对广告的选择与互动；保护您的数据安全等。</p>
                    <p>您有权接受或拒绝 Cookie。大多数浏览器会自动接受Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookie。如果选择拒绝 Cookie，那么您可能无法完全体验所访问的易安联网站或某些服务的全部功能。</p>
                    <p>2、网络Beacon的使用</p>
                    <p>易安联网页上常会包含一些电子图象（称为"单像素" GIF 文件或 "网络 beacon"），它们可以帮助网站计算浏览网页的用户或访问某些cookie。易安联使用网络beacon的方式有：</p>
                    <p class="indent">（1）易安联通过在易安联网站上使用网络beacon，计算用户访问数量，并通过访问 cookie 辨认注册用户。</p>
                    <p class="indent">（2）易安联通过得到的cookie信息，可以在易安联网站提供个性化服务。</p>
                    <h2>七、未成年人的个人信息保护</h2>
                    <p>易安联非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用易安联服务前，应事先取得您家长或法定监护人的书面同意。易安联根据国家相关法律法规的规定保护未成年人的个人信息。</p>
                    <h2>八、通知和修订</h2>
                    <p>为给你提供更好的服务，易安联的业务将不时变化，本隐私政策也将随之调整。易安联会通过在易安联网站、移动端上发出更新版本并提醒您相关内容的更新，也请您访问易安联以便及时了解最新的隐私政策。如果您对于本隐私政策或在使用易安联服务时对于您的个人信息或隐私情况有任何问题，请联系易安联客服并作充分描述，易安联将尽力解决。</p>
                </div>
            </div>
            <span slot="footer" class="dialog-footer">
                <el-button class="canle" @click="closeDialog" plain>返 回</el-button>
            </span>
        </el-dialog>
    </div>
</template>

<script>
    export default {
        name: 'termsTgreement',
        props: {
            visibleDialog: Boolean,
            seedType: String
        },
        watch: {
            visibleDialog (nVal, oVal) {
                if (nVal) this.dialogVisible = true;
            }
        },
        data () {
            return {
                dialogVisible: false
            }
        },
        methods: {
            closeDialog () {
                this.dialogVisible = false;
                this.$emit('closeDialog')
            },
            confirm () {
                this.closeDialog()
            }
        }
    }
</script>

<style lang="scss">
.termsTgreement{
    .el-dialog__header{
        text-align: center;
    }
    .el-dialog__title{
        margin-left: 0;
    }
    .el-dialog__footer{
        height: auto;
        .el-button.canle{
            background: transparent;
        }
    }
}
.dialog_content{
    max-height: 460px;
    overflow-y: auto;
    h2{
        font-size: 16px;
        margin: 0;
        padding: 10px 0;
        line-height: 2;
        color: #112233;
        padding-right: 5px;
    }
    p{
        margin: 0;
        padding: 5px 0;
        line-height: 2;
        color: #123456;
        font-size: 14px;
        text-align: justify;
        padding-right: 10px;
        span{
            font-weight: 600;
        }
    }
    p.bold{
        font-weight: 600;
    }
    p.indent{
        text-indent: 2em;
    }
    h2.main_title{
        font-size: 18px;
        padding-top: 0;
    }
}
</style>